**Load Raw Demographics Dataset into colab**

In [ ]:
import pandas as pd

# Load your data
df = pd.read_csv("/content/api_data_aadhar_demographic_full.csv")

df.head(10)

,date,state,district,pincode,demo_age_5_17,demo_age_17_
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375
2,01-03-2025,Gujarat,Rajkot,360006,65,765
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314
4,01-03-2025,Rajasthan,Udaipur,313801,45,785
5,01-03-2025,Rajasthan,Sikar,332028,28,285
6,01-03-2025,Karnataka,Tumakuru,572201,88,332
7,01-03-2025,Uttar Pradesh,Gorakhpur,273211,61,836
8,01-03-2025,Andhra Pradesh,Kurnool,518313,83,986
9,01-03-2025,West Bengal,Paschim Medinipur,721148,13,281

In [ ]:
df.shape

(2071700, 6)

**Data Cleaning & EDA on State Column**

In [ ]:
# Check unique values
df['state'].unique()

array(['Uttar Pradesh', 'Andhra Pradesh', 'Gujarat', 'Rajasthan',
       'Karnataka', 'West Bengal', 'Telangana', 'Odisha', 'Maharashtra',
       'Kerala', 'Bihar', 'Tamil Nadu', 'Madhya Pradesh', 'Assam',
       'Tripura', 'Arunachal Pradesh', 'Punjab', 'Jharkhand', 'Delhi',
       'Chandigarh', 'Chhattisgarh', 'Jammu and Kashmir', 'Mizoram',
       'Nagaland', 'Himachal Pradesh', 'Goa', 'Haryana', 'Meghalaya',
       'Uttarakhand', 'Manipur', 'Daman and Diu', 'Puducherry', 'Sikkim',
       'Ladakh', 'Dadra and Nagar Haveli and Daman and Diu',
       'Dadra and Nagar Haveli', 'Orissa', 'Pondicherry',
       'Andaman & Nicobar Islands', 'Andaman and Nicobar Islands',
       'west Bengal', 'Daman & Diu', 'West  Bengal', 'odisha',
       'Jammu & Kashmir', 'Lakshadweep', 'Dadra & Nagar Haveli',
       'Westbengal', 'andhra pradesh', 'WEST BENGAL', 'West Bangal',
       'West bengal', 'ODISHA', 'WESTBENGAL', 'Chhatisgarh',
       'West Bengli', 'Darbhanga', 'Puttenahalli', 'BALANAGAR',
       'Uttaranchal', '100000', 'Jaipur', 'Madanapalle', 'Nagpur',
       'Raja Annamalai Puram'], dtype=object)

In [ ]:
df['state'] = (
    df['state']
    .astype(str)
    .str.strip()                    # remove leading/trailing spaces
    .str.lower()                    # lowercase everything
    .str.replace('&', 'and')        # replace & with and
    .str.replace(r'\s+', ' ', regex=True)  # remove extra spaces
)

In [ ]:
state_corrections = {

    # Andhra Pradesh
    "Andhra Pradesh": "Andhra Pradesh",
    "andhra pradesh": "Andhra Pradesh",

    # Arunachal Pradesh
    "Arunachal Pradesh": "Arunachal Pradesh",

    # Assam
    "Assam": "Assam",

    # Bihar
    "Bihar": "Bihar",

    # Chhattisgarh
    "Chhattisgarh": "Chhattisgarh",
    "Chhatisgarh": "Chhattisgarh",

    # Goa
    "Goa": "Goa",

    # Gujarat
    "Gujarat": "Gujarat",

    # Haryana
    "Haryana": "Haryana",

    # Himachal Pradesh
    "Himachal Pradesh": "Himachal Pradesh",

    # Jharkhand
    "Jharkhand": "Jharkhand",

    # Karnataka
    "Karnataka": "Karnataka",

    # Kerala
    "Kerala": "Kerala",

    # Madhya Pradesh
    "Madhya Pradesh": "Madhya Pradesh",

    # Maharashtra
    "Maharashtra": "Maharashtra",

    # Manipur
    "Manipur": "Manipur",

    # Meghalaya
    "Meghalaya": "Meghalaya",

    # Mizoram
    "Mizoram": "Mizoram",

    # Nagaland
    "Nagaland": "Nagaland",

    # Odisha
    "Odisha": "Odisha",
    "Orissa": "Odisha",
    "ODISHA": "Odisha",
    "odisha": "Odisha",

    # Punjab
    "Punjab": "Punjab",

    # Rajasthan
    "Rajasthan": "Rajasthan",

    # Sikkim
    "Sikkim": "Sikkim",

    # Tamil Nadu
    "Tamil Nadu": "Tamil Nadu",
    "Tamilnadu": "Tamil Nadu",

    # Telangana
    "Telangana": "Telangana",

    # Tripura
    "Tripura": "Tripura",

    # Uttar Pradesh
    "Uttar Pradesh": "Uttar Pradesh",

    # Uttarakhand
    "Uttarakhand": "Uttarakhand",
    "Uttaranchal": "Uttarakhand",

    # West Bengal
    "West Bengal": "West Bengal",
    "WESTBENGAL": "West Bengal",
    "Westbengal": "West Bengal",
    "West  Bengal": "West Bengal",
    "WEST BENGAL": "West Bengal",
    "West Bangal": "West Bengal",
    "West bengal": "West Bengal",
    "west Bengal": "West Bengal",

    # --------------------
    # UNION TERRITORIES
    # --------------------

    # Andaman & Nicobar Islands
    "Andaman and Nicobar Islands": "Andaman and Nicobar Islands",
    "Andaman & Nicobar Islands": "Andaman and Nicobar Islands",

    # Chandigarh
    "Chandigarh": "Chandigarh",

    # Dadra & Nagar Haveli and Daman & Diu
    "Dadra and Nagar Haveli and Daman and Diu": "Dadra and Nagar Haveli and Daman and Diu",
    "Dadra and Nagar Haveli": "Dadra and Nagar Haveli and Daman and Diu",
    "Dadra & Nagar Haveli": "Dadra and Nagar Haveli and Daman and Diu",
    "Daman and Diu": "Dadra and Nagar Haveli and Daman and Diu",
    "Daman & Diu": "Dadra and Nagar Haveli and Daman and Diu",

    # Delhi
    "Delhi": "Delhi",

    # Jammu & Kashmir
    "Jammu and Kashmir": "Jammu and Kashmir",
    "Jammu & Kashmir": "Jammu and Kashmir",

    # Ladakh
    "Ladakh": "Ladakh",

    # Lakshadweep
    "Lakshadweep": "Lakshadweep",

    # Puducherry
    "Puducherry": "Puducherry",
    "Pondicherry": "Puducherry"
}

In [ ]:
df['state'] = df['state'].replace(state_corrections)

In [ ]:
df['state'] = df['state'].str.title()

In [ ]:
df['state'].unique()

array(['Uttar Pradesh', 'Andhra Pradesh', 'Gujarat', 'Rajasthan',
       'Karnataka', 'West Bengal', 'Telangana', 'Odisha', 'Maharashtra',
       'Kerala', 'Bihar', 'Tamil Nadu', 'Madhya Pradesh', 'Assam',
       'Tripura', 'Arunachal Pradesh', 'Punjab', 'Jharkhand', 'Delhi',
       'Chandigarh', 'Chhattisgarh', 'Jammu And Kashmir', 'Mizoram',
       'Nagaland', 'Himachal Pradesh', 'Goa', 'Haryana', 'Meghalaya',
       'Uttarakhand', 'Manipur', 'Daman And Diu', 'Puducherry', 'Sikkim',
       'Ladakh', 'Dadra And Nagar Haveli And Daman And Diu',
       'Dadra And Nagar Haveli', 'Orissa', 'Pondicherry',
       'Andaman And Nicobar Islands', 'Lakshadweep', 'Westbengal',
       'West Bangal', 'Chhatisgarh', 'West Bengli', 'Darbhanga',
       'Puttenahalli', 'Balanagar', 'Uttaranchal', '100000', 'Jaipur',
       'Madanapalle', 'Nagpur', 'Raja Annamalai Puram'], dtype=object)

In [ ]:
df = df[df['state'] != '100000']

In [ ]:
state_mapping = {
    # Correct / standard
    'Uttar Pradesh': 'Uttar Pradesh',
    'Andhra Pradesh': 'Andhra Pradesh',
    'Gujarat': 'Gujarat',
    'Rajasthan': 'Rajasthan',
    'Karnataka': 'Karnataka',
    'West Bengal': 'West Bengal',
    'Telangana': 'Telangana',
    'Odisha': 'Odisha',
    'Maharashtra': 'Maharashtra',
    'Kerala': 'Kerala',
    'Bihar': 'Bihar',
    'Tamil Nadu': 'Tamil Nadu',
    'Madhya Pradesh': 'Madhya Pradesh',
    'Assam': 'Assam',
    'Tripura': 'Tripura',
    'Arunachal Pradesh': 'Arunachal Pradesh',
    'Punjab': 'Punjab',
    'Jharkhand': 'Jharkhand',
    'Delhi': 'Delhi',
    'Chandigarh': 'Chandigarh',
    'Chhattisgarh': 'Chhattisgarh',
    'Jammu And Kashmir': 'Jammu and Kashmir',
    'Jammu and Kashmir': 'Jammu and Kashmir',
    'Mizoram': 'Mizoram',
    'Nagaland': 'Nagaland',
    'Himachal Pradesh': 'Himachal Pradesh',
    'Goa': 'Goa',
    'Haryana': 'Haryana',
    'Meghalaya': 'Meghalaya',
    'Uttarakhand': 'Uttarakhand',
    'Manipur': 'Manipur',
    'Puducherry': 'Puducherry',
    'Sikkim': 'Sikkim',
    'Ladakh': 'Ladakh',
    'Lakshadweep': 'Lakshadweep',

    # UTs merged / renamed
    'Daman And Diu': 'Dadra and Nagar Haveli and Daman and Diu',
    'Dadra And Nagar Haveli': 'Dadra and Nagar Haveli and Daman and Diu',
    'Dadra And Nagar Haveli And Daman And Diu': 'Dadra and Nagar Haveli and Daman and Diu',

    # Spelling variants
    'Chhatisgarh': 'Chhattisgarh',
    'Uttaranchal': 'Uttarakhand',
    'West Bengli': 'West Bengal',

    # Andaman
    'Andaman and Nicobar Islands': 'Andaman and Nicobar Islands',
    'Darbhanga' : 'Bihar',            # District (Bihar)
    'Puttenahalli' : 'Karnataka',         # Locality (Bengaluru, Karnataka)
    'Balanagar' : 'Telangana',            # Locality (Hyderabad, Telangana)
    'Jaipur' : 'Rajasthan',               # District (Rajasthan)
    'Madanapalle' : 'Andhra Pradesh',          # Town (Andhra Pradesh)
    'Nagpur' : 'Maharashtra',               # District (Maharashtra)
    'Raja Annamalai Puram' : 'Tamil Nadu'  # Locality (Chennai, Tamil Nadu)

}

In [ ]:
df['state'] = (
    df['state']
    .str.strip()
    .replace(state_mapping)
)

In [ ]:
df['state'].nunique()

36

In [ ]:
df['state'].unique()

array(['Uttar Pradesh', 'Andhra Pradesh', 'Gujarat', 'Rajasthan',
       'Karnataka', 'West Bengal', 'Telangana', 'Odisha', 'Maharashtra',
       'Kerala', 'Bihar', 'Tamil Nadu', 'Madhya Pradesh', 'Assam',
       'Tripura', 'Arunachal Pradesh', 'Punjab', 'Jharkhand', 'Delhi',
       'Chandigarh', 'Chhattisgarh', 'Jammu and Kashmir', 'Mizoram',
       'Nagaland', 'Himachal Pradesh', 'Goa', 'Haryana', 'Meghalaya',
       'Uttarakhand', 'Manipur',
       'Dadra and Nagar Haveli and Daman and Diu', 'Puducherry', 'Sikkim',
       'Ladakh', 'Andaman and Nicobar Islands', 'Lakshadweep'],
      dtype=object)

**Understand Raw data**

In [ ]:
df.shape

(2071698, 6)

In [ ]:
df.isnull().sum()

date             0
state            0
district         0
pincode          0
demo_age_5_17    0
demo_age_17_     0
dtype: int64

**Data Cleaning & EDA on Pincode Column**

In [ ]:
df['pincode'].head()

0    273213
1    517132
2    360006
3    532484
4    313801
Name: pincode, dtype: int64

In [ ]:
df['pincode'].dtype

dtype('int64')

In [ ]:
df['pincode'] = df['pincode'].astype(str).str.strip()

In [ ]:
df = df[df['pincode'].str.match(r'^\d+$')]

In [ ]:
df = df[df['pincode'].str.len() == 6]

In [ ]:
invalid_pins = ['000000', '111111', '999999']
df = df[~df['pincode'].isin(invalid_pins)]

In [ ]:
# Unique pincodes count
df['pincode'].nunique()

19741

In [ ]:
# Check min & max (sanity check)
df['pincode'].astype(int).describe()

count    2.071698e+06
mean     5.278322e+05
std      1.972930e+05
min      1.100010e+05
25%      3.964690e+05
50%      5.243220e+05
75%      6.955070e+05
max      8.554560e+05
Name: pincode, dtype: float64

In [ ]:
df.shape

(2071698, 6)

In [ ]:
df['pincode'] = df['pincode'].astype(str)

**Added New Column pincode_first_digit to Derive Zone Column From Pincode**

In [ ]:
df['pincode_first_digit'] = df['pincode'].str[0]

In [ ]:
df['pincode_first_digit'].unique()

array(['2', '5', '3', '7', '4', '6', '8', '1'], dtype=object)

In [ ]:
df['pincode'].astype(str).str.len().value_counts()

pincode
6    2071698
Name: count, dtype: int64

In [ ]:
df['pincode'].astype(str).str[0].value_counts().sort_index()

pincode
1    140317
2    190864
3    187536
4    280258
5    451044
6    307523
7    376880
8    137276
Name: count, dtype: int64

In [ ]:
df['pincode'].value_counts().head(10)

pincode
533464    488
500055    474
500018    424
491888    412
509105    401
713130    397
506164    397
507111    397
509130    393
743329    392
Name: count, dtype: int64

In [ ]:
df[df['pincode'].astype(str).str.match(r'^0{6}$')]

Empty DataFrame
Columns: [date, state, district, pincode, demo_age_5_17, demo_age_17_, pincode_first_digit]
Index: []

In [ ]:
df.groupby('state')['pincode'].nunique().sort_values(ascending=False)

state
Tamil Nadu                                  2089
Andhra Pradesh                              1846
Uttar Pradesh                               1760
Maharashtra                                 1609
Kerala                                      1416
West Bengal                                 1364
Karnataka                                   1355
Gujarat                                     1030
Rajasthan                                    989
Odisha                                       938
Bihar                                        921
Madhya Pradesh                               796
Telangana                                    658
Assam                                        574
Punjab                                       526
Himachal Pradesh                             449
Jharkhand                                    366
Haryana                                      305
Uttarakhand                                  296
Chhattisgarh                                 268
Jammu and Kashmir                            205
Delhi                                         93
Goa                                           88
Tripura                                       86
Meghalaya                                     67
Manipur                                       54
Arunachal Pradesh                             53
Mizoram                                       50
Nagaland                                      44
Puducherry                                    37
Chandigarh                                    26
Andaman and Nicobar Islands                   22
Sikkim                                        22
Ladakh                                        15
Dadra and Nagar Haveli and Daman and Diu      10
Lakshadweep                                    9
Name: pincode, dtype: int64

In [ ]:
df.shape

(2071698, 7)

**Zone Column Derived From Pincode**

In [ ]:
df['zone'] = 'Unknown'

df.loc[df['pincode_first_digit'].isin(['1', '2']), 'zone'] = 'North'
df.loc[df['pincode_first_digit'].isin(['3', '4']), 'zone'] = 'West'
df.loc[df['pincode_first_digit'].isin(['5', '6']), 'zone'] = 'South'
df.loc[df['pincode_first_digit'].isin(['7', '8']), 'zone'] = 'East'
df.loc[df['pincode_first_digit'] == '9', 'zone'] = 'Other'

In [ ]:
df[['pincode_first_digit', 'zone']].value_counts().head(10)

pincode_first_digit  zone
5                    South    451044
7                    East     376880
6                    South    307523
4                    West     280258
2                    North    190864
3                    West     187536
1                    North    140317
8                    East     137276
Name: count, dtype: int64

In [ ]:
df['zone'].value_counts()

zone
South    758567
East     514156
West     467794
North    331181
Name: count, dtype: int64

In [ ]:
df.shape

(2071698, 8)

**Data Cleaning & EDA on Date Column**

In [ ]:
df['date'].isnull().sum()

np.int64(0)

In [ ]:
df['date_dt'] = pd.to_datetime(
    df['date'],
    dayfirst=True,
    errors='coerce'
)

In [ ]:
df['date_dt'].isnull().sum()

np.int64(0)

In [ ]:
df.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,pincode_first_digit,zone,date_dt
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,2,North,2025-03-01
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,5,South,2025-03-01
2,01-03-2025,Gujarat,Rajkot,360006,65,765,3,West,2025-03-01
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,5,South,2025-03-01
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,3,West,2025-03-01

**Derived Year, Month, Month Name, Day Name, Week From Date Column**

In [ ]:
df['year'] = df['date_dt'].dt.year

In [ ]:
df['year'].value_counts().sort_index()

year
2025    2071698
Name: count, dtype: int64

In [ ]:
df['month'] = df['date_dt'].dt.month
df['month_name'] = df['date_dt'].dt.month_name()
df['day_name'] = df['date_dt'].dt.day_name()
df['week'] = df['date_dt'].dt.isocalendar().week

In [ ]:
df.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,pincode_first_digit,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,2,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,5,South,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Gujarat,Rajkot,360006,65,765,3,West,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,5,South,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,3,West,2025-03-01,2025,3,March,Saturday,9

**Demographic Updates Per Month**

In [ ]:
month_order = [
    'January','February','March','April','May','June',
    'July','August','September','October','November','December'
]

month_counts = (
    df['month_name']
    .value_counts()
    .reindex(month_order, fill_value=0)
)

month_counts

month_name
January           0
February          0
March         18418
April          1103
May            1374
June           1117
July           1376
August            0
September    449761
October      374116
November     566826
December     657607
Name: count, dtype: int64

**Demographic Updates Per Day**

In [ ]:
df['day_name'].value_counts().reindex([
    'Monday','Tuesday','Wednesday','Thursday',
    'Friday','Saturday','Sunday'
])

day_name
Monday       321543
Tuesday      305072
Wednesday    280766
Thursday     307108
Friday       329905
Saturday     315935
Sunday       211369
Name: count, dtype: int64

In [ ]:
df.groupby(df['date_dt'].dt.to_period('M')).size()

date_dt
2025-03     18418
2025-04      1103
2025-05      1374
2025-06      1117
2025-07      1376
2025-09    449761
2025-10    374116
2025-11    566826
2025-12    657607
Freq: M, dtype: int64

In [ ]:
df.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,pincode_first_digit,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,2,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,5,South,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Gujarat,Rajkot,360006,65,765,3,West,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,5,South,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,3,West,2025-03-01,2025,3,March,Saturday,9

**Data Cleaning & EDA on District Column**

In [ ]:
df['district'].dtype

dtype('O')

In [ ]:
df['district'].nunique()

982

In [ ]:
df = df.drop(columns=['pincode_first_digit'])

In [ ]:
df['district_clean'] = df['district']

In [ ]:
df['state_correct'] = df['state']

In [ ]:
df['state'].unique()

array(['Uttar Pradesh', 'Andhra Pradesh', 'Gujarat', 'Rajasthan',
       'Karnataka', 'West Bengal', 'Telangana', 'Odisha', 'Maharashtra',
       'Kerala', 'Bihar', 'Tamil Nadu', 'Madhya Pradesh', 'Assam',
       'Tripura', 'Arunachal Pradesh', 'Punjab', 'Jharkhand', 'Delhi',
       'Chandigarh', 'Chhattisgarh', 'Jammu and Kashmir', 'Mizoram',
       'Nagaland', 'Himachal Pradesh', 'Goa', 'Haryana', 'Meghalaya',
       'Uttarakhand', 'Manipur',
       'Dadra and Nagar Haveli and Daman and Diu', 'Puducherry', 'Sikkim',
       'Ladakh', 'Andaman and Nicobar Islands', 'Lakshadweep'],
      dtype=object)

**Clean District From Deriving Data From Main Table Per State and Than Clean District and than Update back to Main Table**

In [ ]:
df_L = df[df['state'] == 'Uttar Pradesh']
df_L.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,North,2025-03-01,2025,3,March,Saturday,9,Gorakhpur,Uttar Pradesh
7,01-03-2025,Uttar Pradesh,Gorakhpur,273211,61,836,North,2025-03-01,2025,3,March,Saturday,9,Gorakhpur,Uttar Pradesh
10,01-03-2025,Uttar Pradesh,Ghazipur,233226,134,1591,North,2025-03-01,2025,3,March,Saturday,9,Ghazipur,Uttar Pradesh
35,01-03-2025,Uttar Pradesh,Muzaffarnagar,247775,22,222,North,2025-03-01,2025,3,March,Saturday,9,Muzaffarnagar,Uttar Pradesh
45,01-03-2025,Uttar Pradesh,Bahraich,271821,54,556,North,2025-03-01,2025,3,March,Saturday,9,Bahraich,Uttar Pradesh

In [ ]:
df_L.shape

(164760, 15)

In [ ]:
df_L['district_clean'] = df_L['district']
df_L['district_clean'].unique()

/tmp/ipython-input-1478444784.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_L['district_clean'] = df_L['district']

array(['Gorakhpur', 'Ghazipur', 'Muzaffarnagar', 'Bahraich', 'Saharanpur',
       'Deoria', 'Shahjahanpur', 'Kannauj', 'Amethi', 'Siddharthnagar',
       'Bara Banki', 'Hardoi', 'Ambedkar Nagar', 'Auraiya', 'Prayagraj',
       'Pratapgarh', 'Balrampur', 'Rae Bareli', 'Azamgarh', 'Amroha',
       'Sultanpur', 'Gonda', 'Mainpuri', 'Moradabad', 'Varanasi',
       'Bijnor', 'Firozabad', 'Farrukhabad', 'Basti', 'Jaunpur',
       'Maharajganj', 'Kaushambi', 'Sitapur', 'Aligarh', 'Kheri', 'Mau',
       'Sonbhadra', 'Bulandshahr', 'Fatehpur', 'Ayodhya', 'Kasganj',
       'Faizabad', 'Ballia', 'Kanpur Nagar', 'Lucknow', 'Agra',
       'Sant Kabir Nagar', 'Shrawasti', 'Bhadohi', 'Ghaziabad',
       'Lalitpur', 'Meerut', 'Mathura', 'Allahabad', 'Etah', 'Etawah',
       'Gautam Buddha Nagar', 'Hathras', 'Rampur', 'Bareilly', 'Jhansi',
       'Pilibhit', 'Hamirpur', 'Shamli', 'Mahoba', 'Sambhal',
       'Sant Ravidas Nagar', 'Kanpur Dehat', 'Baghpat', 'Kushinagar',
       'Mirzapur', 'Budaun', 'Unnao', 'Jalaun', 'Hapur', 'Chandauli',
       'Banda', 'Bulandshahar', 'Chitrakoot', 'Kushinagar *',
       'Sant Ravidas Nagar Bhadohi', 'Barabanki', 'Jyotiba Phule Nagar',
       'Mahrajganj', 'Bagpat', 'Raebareli', 'Baghpat *',
       'Jyotiba Phule Nagar *', 'Chitrakoot *', 'Chandauli *'],
      dtype=object)

In [ ]:
L_mapping = {
    # Old  New names
    'Allahabad': 'Prayagraj',
    'Faizabad': 'Ayodhya',
    'Jyotiba Phule Nagar': 'Amroha',
    'Raebareli': 'Rae Bareli',
    'Mahrajganj': 'Maharajganj',

    # Variants & symbols
    'Kushinagar *': 'Kushinagar',
    'Baghpat *': 'Baghpat',
    'Chitrakoot *': 'Chitrakoot',
    'Chandauli *': 'Chandauli',
    'Jyotiba Phule Nagar *': 'Amroha',
    'Sant Ravidas Nagar Bhadohi': 'Sant Ravidas Nagar',

    # Spelling / duplicate normalization
    'Barabanki': 'Bara Banki',
    'Bulandshahar': 'Bulandshahr',

    # Identity mappings (already correct)
    'Gorakhpur': 'Gorakhpur',
    'Ghazipur': 'Ghazipur',
    'Muzaffarnagar': 'Muzaffarnagar',
    'Bahraich': 'Bahraich',
    'Saharanpur': 'Saharanpur',
    'Deoria': 'Deoria',
    'Shahjahanpur': 'Shahjahanpur',
    'Kannauj': 'Kannauj',
    'Amethi': 'Amethi',
    'Siddharthnagar': 'Siddharthnagar',
    'Bara Banki': 'Bara Banki',
    'Hardoi': 'Hardoi',
    'Ambedkar Nagar': 'Ambedkar Nagar',
    'Auraiya': 'Auraiya',
    'Prayagraj': 'Prayagraj',
    'Pratapgarh': 'Pratapgarh',
    'Balrampur': 'Balrampur',
    'Rae Bareli': 'Rae Bareli',
    'Azamgarh': 'Azamgarh',
    'Amroha': 'Amroha',
    'Sultanpur': 'Sultanpur',
    'Gonda': 'Gonda',
    'Mainpuri': 'Mainpuri',
    'Moradabad': 'Moradabad',
    'Varanasi': 'Varanasi',
    'Bijnor': 'Bijnor',
    'Firozabad': 'Firozabad',
    'Farrukhabad': 'Farrukhabad',
    'Basti': 'Basti',
    'Jaunpur': 'Jaunpur',
    'Maharajganj': 'Maharajganj',
    'Kaushambi': 'Kaushambi',
    'Sitapur': 'Sitapur',
    'Aligarh': 'Aligarh',
    'Kheri': 'Kheri',
    'Mau': 'Mau',
    'Sonbhadra': 'Sonbhadra',
    'Bulandshahr': 'Bulandshahr',
    'Fatehpur': 'Fatehpur',
    'Ayodhya': 'Ayodhya',
    'Kasganj': 'Kasganj',
    'Ballia': 'Ballia',
    'Kanpur Nagar': 'Kanpur Nagar',
    'Lucknow': 'Lucknow',
    'Agra': 'Agra',
    'Sant Kabir Nagar': 'Sant Kabir Nagar',
    'Shrawasti': 'Shrawasti',
    'Bhadohi': 'Sant Ravidas Nagar',
    'Ghaziabad': 'Ghaziabad',
    'Lalitpur': 'Lalitpur',
    'Meerut': 'Meerut',
    'Mathura': 'Mathura',
    'Etah': 'Etah',
    'Etawah': 'Etawah',
    'Gautam Buddha Nagar': 'Gautam Buddha Nagar',
    'Hathras': 'Hathras',
    'Rampur': 'Rampur',
    'Bareilly': 'Bareilly',
    'Jhansi': 'Jhansi',
    'Pilibhit': 'Pilibhit',
    'Hamirpur': 'Hamirpur',
    'Shamli': 'Shamli',
    'Mahoba': 'Mahoba',
    'Sambhal': 'Sambhal',
    'Kanpur Dehat': 'Kanpur Dehat',
    'Baghpat': 'Baghpat',
    'Kushinagar': 'Kushinagar',
    'Mirzapur': 'Mirzapur',
    'Budaun': 'Budaun',
    'Unnao': 'Unnao',
    'Jalaun': 'Jalaun',
    'Hapur': 'Hapur',
    'Chandauli': 'Chandauli',
    'Banda': 'Banda',
    'Chitrakoot': 'Chitrakoot',
    'Bagpat' : 'Baghpat'
}

In [ ]:
df_L['district_clean'] = (
    df_L['district_clean']
    .replace(L_mapping)
)

/tmp/ipython-input-1503597074.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_L['district_clean'] = (

In [ ]:
df_L['district_clean'].unique()

array(['Gorakhpur', 'Ghazipur', 'Muzaffarnagar', 'Bahraich', 'Saharanpur',
       'Deoria', 'Shahjahanpur', 'Kannauj', 'Amethi', 'Siddharthnagar',
       'Bara Banki', 'Hardoi', 'Ambedkar Nagar', 'Auraiya', 'Prayagraj',
       'Pratapgarh', 'Balrampur', 'Rae Bareli', 'Azamgarh', 'Amroha',
       'Sultanpur', 'Gonda', 'Mainpuri', 'Moradabad', 'Varanasi',
       'Bijnor', 'Firozabad', 'Farrukhabad', 'Basti', 'Jaunpur',
       'Maharajganj', 'Kaushambi', 'Sitapur', 'Aligarh', 'Kheri', 'Mau',
       'Sonbhadra', 'Bulandshahr', 'Fatehpur', 'Ayodhya', 'Kasganj',
       'Ballia', 'Kanpur Nagar', 'Lucknow', 'Agra', 'Sant Kabir Nagar',
       'Shrawasti', 'Sant Ravidas Nagar', 'Ghaziabad', 'Lalitpur',
       'Meerut', 'Mathura', 'Etah', 'Etawah', 'Gautam Buddha Nagar',
       'Hathras', 'Rampur', 'Bareilly', 'Jhansi', 'Pilibhit', 'Hamirpur',
       'Shamli', 'Mahoba', 'Sambhal', 'Kanpur Dehat', 'Baghpat',
       'Kushinagar', 'Mirzapur', 'Budaun', 'Unnao', 'Jalaun', 'Hapur',
       'Chandauli', 'Banda', 'Chitrakoot', 'Bagpat'], dtype=object)

In [ ]:
df_L['district_clean'].nunique()

75

In [ ]:
df.shape

(2071698, 15)

In [ ]:
mask = df['state'] == 'Uttar Pradesh'
df.loc[mask, 'district'] = df_L['district_clean'].values

In [ ]:
df.shape

(2071698, 15)

In [ ]:
df.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,North,2025-03-01,2025,3,March,Saturday,9,Gorakhpur,Uttar Pradesh
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,South,2025-03-01,2025,3,March,Saturday,9,Chittoor,Andhra Pradesh
2,01-03-2025,Gujarat,Rajkot,360006,65,765,West,2025-03-01,2025,3,March,Saturday,9,Rajkot,Gujarat
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,South,2025-03-01,2025,3,March,Saturday,9,Srikakulam,Andhra Pradesh
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,West,2025-03-01,2025,3,March,Saturday,9,Udaipur,Rajasthan

In [ ]:
df[df['state'] == 'Jammu and Kashmir']['district'].nunique()

20

**Clean District That Present in Wrong State**

In [ ]:
Tamilnadu_districts_raw = [
    'Leh',
    'Leh (ladakh)',
    'Kargil'
]

In [ ]:
mask = (
    df['district_clean'].isin(Tamilnadu_districts_raw) &
    (df['state'] == 'Jammu and Kashmir')
)

df.loc[mask, 'state'] = 'Ladakh'

In [ ]:
df = df[df['district'].str.strip() != '?']

In [ ]:
df[df['district_clean'] == 'Andamans']

,date,state,district,pincode,demo_age_5_17,demo_age_17_,zone,date_dt,year,month,month_name,day_name,week,district_clean,state_correct
6660,01-09-2025,Andaman and Nicobar Islands,Andamans,744103,0,1,East,2025-09-01,2025,9,September,Monday,36,Andamans,Andaman and Nicobar Islands
38126,09-09-2025,Andaman and Nicobar Islands,Andamans,744103,0,3,East,2025-09-09,2025,9,September,Tuesday,37,Andamans,Andaman and Nicobar Islands
38127,09-09-2025,Andaman and Nicobar Islands,Andamans,744105,0,3,East,2025-09-09,2025,9,September,Tuesday,37,Andamans,Andaman and Nicobar Islands
51264,12-09-2025,Andaman and Nicobar Islands,Andamans,744101,0,3,East,2025-09-12,2025,9,September,Friday,37,Andamans,Andaman and Nicobar Islands
51265,12-09-2025,Andaman and Nicobar Islands,Andamans,744106,0,2,East,2025-09-12,2025,9,September,Friday,37,Andamans,Andaman and Nicobar Islands
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2040417,23-12-2025,Andaman and Nicobar Islands,Andamans,744206,0,1,East,2025-12-23,2025,12,December,Tuesday,52,Andamans,Andaman and Nicobar Islands
2046999,24-12-2025,Andaman and Nicobar Islands,Andamans,744103,0,5,East,2025-12-24,2025,12,December,Wednesday,52,Andamans,Andaman and Nicobar Islands
2047000,24-12-2025,Andaman and Nicobar Islands,Andamans,744106,0,3,East,2025-12-24,2025,12,December,Wednesday,52,Andamans,Andaman and Nicobar Islands
2059381,27-12-2025,Andaman and Nicobar Islands,Andamans,744101,0,1,East,2025-12-27,2025,12,December,Saturday,52,Andamans,Andaman and Nicobar Islands
2060949,27-12-2025,Andaman and Nicobar Islands,Andamans,744103,0,2,East,2025-12-27,2025,12,December,Saturday,52,Andamans,Andaman and Nicobar Islands

In [ ]:
df['state'].nunique()
#df['state_correct'].nunique()

36

In [ ]:
df['district'].nunique()
#df['district_clean'].nunique()

768

In [ ]:
df = df.drop(columns=['state_correct', 'district_clean'])

In [ ]:
df.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,South,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Gujarat,Rajkot,360006,65,765,West,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,South,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,West,2025-03-01,2025,3,March,Saturday,9

In [ ]:
df.groupby('state')['district'].nunique().sort_values(ascending=False)

state
Uttar Pradesh                               75
Madhya Pradesh                              55
Rajasthan                                   42
Bihar                                       38
Tamil Nadu                                  38
Maharashtra                                 36
Assam                                       35
Gujarat                                     33
Telangana                                   33
Chhattisgarh                                33
Karnataka                                   31
Odisha                                      30
Andhra Pradesh                              26
Arunachal Pradesh                           25
Jharkhand                                   24
Punjab                                      24
West Bengal                                 23
Haryana                                     22
Jammu and Kashmir                           20
Nagaland                                    16
Kerala                                      14
Manipur                                     13
Uttarakhand                                 13
Himachal Pradesh                            12
Meghalaya                                   12
Mizoram                                     11
Delhi                                       11
Tripura                                      8
Sikkim                                       4
Andaman and Nicobar Islands                  3
Dadra and Nagar Haveli and Daman and Diu     3
Puducherry                                   3
Goa                                          2
Ladakh                                       2
Lakshadweep                                  1
Chandigarh                                   1
Name: district, dtype: int64

In [ ]:
df['district'].value_counts().head(10)

district
Purba Bardhaman               22374
Anantapur                     19698
Bengaluru Urban               18993
North Twenty Four Parganas    17443
Belagavi                      15626
Hanumakonda                   14734
Villupuram                    13124
Ranga Reddy                   12717
Pune                          12450
Purba Medinipur               12371
Name: count, dtype: int64

In [ ]:
df['district'].value_counts().tail(10)

district
Kurung Kumey     74
Pherzawl         58
Tseminyu         52
Kamle            49
Pakke Kessang    48
Hnahthial        31
Khawzawl         26
Leparada         21
Mohali            5
Kangpokpi         3
Name: count, dtype: int64

In [ ]:
top10 = df['district'].value_counts().head(10)
(top10 / len(df)) * 100

district
Purba Bardhaman               1.079984
Anantapur                     0.950814
Bengaluru Urban               0.916784
North Twenty Four Parganas    0.841966
Belagavi                      0.754261
Hanumakonda                   0.711204
Villupuram                    0.633490
Ranga Reddy                   0.613844
Pune                          0.600956
Purba Medinipur               0.597143
Name: count, dtype: float64

In [ ]:
df.groupby(['state', 'district']).size() \
  .sort_values(ascending=False).head(10)

state           district
West Bengal     Purba Bardhaman               22374
Andhra Pradesh  Anantapur                     19698
Karnataka       Bengaluru Urban               18993
West Bengal     North Twenty Four Parganas    17443
Karnataka       Belagavi                      15626
Telangana       Hanumakonda                   14734
Tamil Nadu      Villupuram                    13124
Telangana       Ranga Reddy                   12717
Maharashtra     Pune                          12450
West Bengal     Purba Medinipur               12371
dtype: int64

In [ ]:
df.groupby('zone')['district'].nunique()

zone
East     242
North    179
South    146
West     204
Name: district, dtype: int64

In [ ]:
df.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,South,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Gujarat,Rajkot,360006,65,765,West,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,South,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,West,2025-03-01,2025,3,March,Saturday,9

**Data Cleaning & EDA on demo_age_5_17 Column**

In [ ]:
df['demo_age_5_17'].dtype

dtype('int64')

In [ ]:
df['demo_age_5_17'].isnull().sum()

np.int64(0)

In [ ]:
(df['demo_age_5_17'] < 0).sum()

np.int64(0)

In [ ]:
df['demo_age_5_17'].describe()

count    2.071698e+06
mean     2.347555e+00
std      1.490356e+01
min      0.000000e+00
25%      0.000000e+00
50%      1.000000e+00
75%      2.000000e+00
max      2.690000e+03
Name: demo_age_5_17, dtype: float64

In [ ]:
df.groupby('state')['demo_age_5_17'].sum() \
  .sort_values(ascending=False)

state
Uttar Pradesh                               790308
Madhya Pradesh                              407098
Bihar                                       380023
Tamil Nadu                                  315638
Andhra Pradesh                              295446
Maharashtra                                 273322
Telangana                                   267961
Karnataka                                   264981
Rajasthan                                   257224
West Bengal                                 242561
Gujarat                                     208474
Delhi                                       175535
Chhattisgarh                                165207
Odisha                                      147499
Haryana                                     139314
Jharkhand                                    99376
Assam                                        84480
Kerala                                       61064
Jammu and Kashmir                            57070
Punjab                                       56867
Uttarakhand                                  49926
Manipur                                      41464
Himachal Pradesh                             19424
Chandigarh                                   13132
Tripura                                      11791
Meghalaya                                     8426
Arunachal Pradesh                             5783
Mizoram                                       5302
Puducherry                                    4696
Nagaland                                      4314
Goa                                           3275
Ladakh                                        2178
Dadra and Nagar Haveli and Daman and Diu      1923
Sikkim                                        1555
Andaman and Nicobar Islands                    617
Lakshadweep                                    170
Name: demo_age_5_17, dtype: int64

In [ ]:
df.groupby('district')['demo_age_5_17'].sum() \
  .sort_values(ascending=False).head(15)

district
Bengaluru Urban               42736
North West Delhi              39744
Hyderabad                     36317
Thane                         36090
Ranga Reddy                   36002
Surat                         35198
Pune                          32644
Ahmedabad                     32052
Murshidabad                   31110
Anantapur                     29860
Jaipur                        29544
Kurnool                       29378
Chittoor                      28657
South Twenty Four Parganas    28544
North East Delhi              25749
Name: demo_age_5_17, dtype: int64

In [ ]:
(df['demo_age_5_17'] == 0).sum()

np.int64(996462)

In [ ]:
df['demo_age_5_17'].min()

0

In [ ]:
df['demo_age_5_17'].max()

2690

In [ ]:
df.shape

(2071698, 13)

**Data Cleaning & EDA on demo_age_17_ column**

In [ ]:
df['demo_age_17_'].dtype

dtype('int64')

In [ ]:
df['demo_age_17_'].isnull().sum()

np.int64(0)

In [ ]:
(df['demo_age_17_'] < 0).sum()

np.int64(0)

In [ ]:
df['demo_age_17_'].describe()

count    2.071698e+06
mean     2.144703e+01
std      1.252498e+02
min      0.000000e+00
25%      2.000000e+00
50%      6.000000e+00
75%      1.500000e+01
max      1.616600e+04
Name: demo_age_17_, dtype: float64

In [ ]:
df.groupby('district')['demo_age_17_'].sum() \
  .sort_values(ascending=False).head(15)

district
South Twenty Four Parganas    414756
Thane                         411164
Pune                          405834
Murshidabad                   340843
Surat                         322384
Bengaluru Urban               316745
North Twenty Four Parganas    294923
North West Delhi              274245
Solapur                       257811
Uttar Dinajpur                257470
Jaipur                        245796
Ahmedabad                     243592
Nashik                        231315
East Champaran                230716
Paschim Medinipur             229939
Name: demo_age_17_, dtype: int64

In [ ]:
df.groupby('state')['demo_age_17_'].sum() \
  .sort_values(ascending=False)

state
Uttar Pradesh                               7752020
Maharashtra                                 4781281
Bihar                                       4434329
West Bengal                                 3630176
Rajasthan                                   2560393
Madhya Pradesh                              2505840
Tamil Nadu                                  1896591
Chhattisgarh                                1840231
Andhra Pradesh                              1761937
Gujarat                                     1615853
Telangana                                   1600150
Karnataka                                   1430305
Jharkhand                                   1301813
Delhi                                       1263399
Haryana                                     1026826
Odisha                                       964566
Assam                                        928098
Punjab                                       825053
Kerala                                       683888
Uttarakhand                                  413716
Jammu and Kashmir                            346642
Manipur                                      260085
Himachal Pradesh                             129790
Tripura                                      126222
Meghalaya                                     78952
Chandigarh                                    70204
Mizoram                                       36604
Nagaland                                      32477
Goa                                           31845
Arunachal Pradesh                             30660
Puducherry                                    28067
Sikkim                                        18785
Dadra and Nagar Haveli and Daman and Diu      10281
Ladakh                                         7047
Andaman and Nicobar Islands                    6629
Lakshadweep                                    1006
Name: demo_age_17_, dtype: int64

In [ ]:
(df['demo_age_17_'] == 0).sum()

np.int64(41810)

In [ ]:
df['demo_age_17_'].min()

0

In [ ]:
df['demo_age_17_'].max()

16166

In [ ]:
df.shape

(2071698, 13)

In [ ]:
df.head()

,date,state,district,pincode,demo_age_5_17,demo_age_17_,zone,date_dt,year,month,month_name,day_name,week
0,01-03-2025,Uttar Pradesh,Gorakhpur,273213,49,529,North,2025-03-01,2025,3,March,Saturday,9
1,01-03-2025,Andhra Pradesh,Chittoor,517132,22,375,South,2025-03-01,2025,3,March,Saturday,9
2,01-03-2025,Gujarat,Rajkot,360006,65,765,West,2025-03-01,2025,3,March,Saturday,9
3,01-03-2025,Andhra Pradesh,Srikakulam,532484,24,314,South,2025-03-01,2025,3,March,Saturday,9
4,01-03-2025,Rajasthan,Udaipur,313801,45,785,West,2025-03-01,2025,3,March,Saturday,9

**Reorder Columns For Easy Data Understanding**

In [ ]:
df = df[
    [
        'date',
        'date_dt',
        'year',
        'week',
        'month',
        'month_name',
        'day_name',
        'state',
        'district',
        'pincode',
        'zone',
        'demo_age_5_17',
        'demo_age_17_',
    ]
]

In [ ]:
df.shape

(2071698, 13)

In [ ]:
df.head()

,date,date_dt,year,week,month,month_name,day_name,state,district,pincode,zone,demo_age_5_17,demo_age_17_
0,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Uttar Pradesh,Gorakhpur,273213,North,49,529
1,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Andhra Pradesh,Chittoor,517132,South,22,375
2,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Gujarat,Rajkot,360006,West,65,765
3,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Andhra Pradesh,Srikakulam,532484,South,24,314
4,01-03-2025,2025-03-01,2025,9,3,March,Saturday,Rajasthan,Udaipur,313801,West,45,785

**Derive New Columns minor_services & Adult_services For Data Uniformity**

In [ ]:
df['minor_services'] = df['demo_age_5_17']
df['adult_services'] = df['demo_age_17_']

**Derived column for Total Enrolement Activity**

In [ ]:
df['total_activity'] = df['minor_services'] + df['adult_services']

**Add Updates back to Demographic Dataset**

In [ ]:
df.to_csv(
    "/content/api_data_aadhar_demographic_v1_cleaned.csv",
    index=False
)